title: Suspicious Internal SSH from External IP
id: 1004-suspicious-ssh
status: experimental
level: high
description: SSH failed login from an IP outside the internal network
logsource:
  service: sshd
detection:
  selection:
    _source_type: sshd
    event_type: ssh_auth_failure
  filter:
    src_ip|startswith: "10.0."
  condition: selection and not filter
